{
  "Kennett Square": [
    {
      "name": "Treetops Kitty Cafe - Cat Adoption and Visitation Center",
      "address": "305 W State St, Kennett Square, PA 19348, USA",
      "rating": 4.7,
      "user_ratings_total": 182,
      "website": "https://treetopskittycafe.com/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=4200902982285011453",
      "lat": 39.8465911,
      "lng": -75.7148717,
      "accessibility_options": {
        "wheelchairAccessibleParking": true,
        "wheelchairAccessibleEntrance": true,
        "wheelchairAccessibleRestroom": true
      },
      "reviews": [
        {
          "author": "Kate",
          "rating": 5,
          "text": {
            "text": "Wish I could take all the kitties home! It’s such a lovely space and the adoptable cats are happy and well-cared for. Was happy to support them with the entry fee and purchasing some merch. Come find your next fur-friend here!",
            "languageCode": "en"
          },
          "time": "4 weeks ago"
        },
        {
          "author": "Juniper Torell",
          "rating": 5,
          "text": {
            "text": "We went to cat Bingo last night and it was really fun.  They had a nice set of prizes and the bingo was fun but the best part was all the cat shenanigans going on the entire time.  That’s a group of super lucky kitties to have Treetop as their temporary home.",
            "languageCode": "en"
          },
          "time": "4 months ago"
        },
        {
          "author": "Taylor Link",
          "rating": 5,
          "text": {
            "text": "I have visited the cafe over 3 times and each time is a relaxing and enjoyable experience with the cats. The newest interior is gorgeous and you can tell the cats have lots of stimulating toys and places to climb, run and sleep. I actually adopted my first cat from Treetops and they helped me with all my anxious cat questions and followed up with me multiple times after adoption. My kitty was previously feral and they were honest with me about her entire situation and history. She is an anxious girl but so am I and we are truly peas in a pod. We are constantly with each other at home and I am so so lucky to have this angel of a kitty. Thank you Treetops!! I recommend them 100%",
            "languageCode": "en"
          },
          "time": "8 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ244xMmONK9WGcwiLdt7ULIRJhZttD1fb_jTKtVYMF2AOZNoJdIl1cmT5TJl4a649S8QgT1NQAUB2AzMPqBm2Wqwoxr6CbT2Ni9NAsDCZnH0fi1o5sy9BetUmssh3BSD3gmJ3q29VRshSKSLamLJptdI_V6U9f_TCBReItwO1oXB_9hOfjNlzC1WVRs-VKcCm9PehTEHdkpX_jiwfRVwT5VPP5cgTNxgHDjuE-a0XBLZKj3YB2fdwhbPaJc5QGUypgNwKzWWJZnkKqxKFuxq1OsVaJaDSyba9A2PWqAcFp9_A&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Norwood": [
    {
      "name": "Cat Nook Cafe",
      "address": "18 W Winona Ave, Norwood, PA 19074, USA",
      "rating": 4.6,
      "user_ratings_total": 135,
      "website": "https://catnookcafe.com/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=17262402519114440371",
      "lat": 39.889316799999996,
      "lng": -75.300283,
      "accessibility_options": "N/A",
      "reviews": [
        {
          "author": "Jennifer Jchan",
          "rating": 5,
          "text": {
            "text": "The cats are so cute and friendly! The cafe is decorated so well and cute! The staff is friendly and very helpful. The merch is worth buying and the cafe is in a great area. Definitely a chill place to forget everything when you're petting cats for an hour! We'll be visiting again.",
            "languageCode": "en"
          },
          "time": "4 months ago"
        },
        {
          "author": "Keith W.",
          "rating": 5,
          "text": {
            "text": "The Cat Nook Cafe in Norwood is a haven for cat lovers. For just $10 an hour, you can relax and enjoy the company of  10-12 adorable, adoptable cats! The fee goes directly to supporting the organization and the care of these furry friends.\n\nThe staff are incredibly friendly and clearly passionate about their feline residents. They're happy to share information about each cat's personality and care, which adds a personal touch.  While the cat area is cozy, it's a clean and comfortable space with plenty of seating for around 6 people.  There are even a few toys available so you can engage and play with the cats!\n\nWhat's even better is that all the kitties are available for adoption.  They've partnered with a local rescue, giving these furry friends a chance to find their forever homes.\n\nIt's the perfect spot to unwind and de-stress with some feline company.  Parking is easy, too, with spots available along the side of the road and a parking area across the street. Highly recommend a visit!",
            "languageCode": "en"
          },
          "time": "2 months ago"
        },
        {
          "author": "Kait",
          "rating": 5,
          "text": {
            "text": "Cute place! Small cafe area where you can buy coffee, tea, and snacks. Cat lounge had around 10 kitties, all very friendly. Less of a cafe; you come for the cats! It was so nice to just hang out and play with them. There are lots of toys and beds for the cats. Couches for the people. They had music on for a nice ambiance. There was a family there at the same time as me, but I didn't mind sharing time with them. I would love to come back soon!",
            "languageCode": "en"
          },
          "time": "7 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ2qE6J24Jya9uOMgDluMRCsTMbDqZaZj2Gr_PvhwOjokbgumkFsuRtq2B1148pXN8x_nDPIkhBmhq9hJ0UTsTDLiNWkzLDc37ir7QFu9aAINPADPC-Khx6oK8AbeuQ-p_AoGkuqSY0YD6AGfEoxeTORPvC-O4bXNh40cQA_vOxLs3omUtFCexcEviKpnmQZ9cVYkPl0KxLKmU49b-5YNV5rJlhBcYmWuLpC03EliwM6HdUSxuGjO2Fjg53vJdHDAXMptlpVortyjWWmmw9jLE4Tvqon_6hEI08hHfWD5OUZT7iyV6k7sFL__u1VDlmNHgmuGBwiPkuHRDzMk_eTlV6km1ogGi-zx3TppuGPRmrkEPbD4QPhqonWmJEU34Sd1XjKlkvP5vez52TzE_DVbZu_lD9QdWhz&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Devon": [
    {
      "name": "The Black Cat Cafe",
      "address": "42 Berkley Rd, Devon, PA 19333, USA",
      "rating": 4.7,
      "user_ratings_total": 382,
      "website": "https://www.theblackcatcafedevon.org/",
      "price_level": "PRICE_LEVEL_MODERATE",
      "google_maps_url": "https://maps.google.com/?cid=3544173227993990389",
      "lat": 40.046580999999996,
      "lng": -75.4140554,
      "accessibility_options": {
        "wheelchairAccessibleParking": true,
        "wheelchairAccessibleEntrance": true,
        "wheelchairAccessibleRestroom": true,
        "wheelchairAccessibleSeating": true
      },
      "reviews": [
        {
          "author": "Mark S Smith",
          "rating": 3,
          "text": {
            "text": "Family brunch at a small cafe in Devon. I have to admit I was kind of freaked out when we arrived and they had a number of cats in crates near the front door. But I have come to learn that this is a non-profit operation where all the proceeds benefit the needs of homeless, abandoned, injured and sick cats and kittens.  Wow! They were very accommodating to us when we had to keep changing our reservation. Kudos to them!!!  The actual food was just okay.  My home fries were burned.  My French toast was mildly tasty.  The creamed chipped beef had a very odd flavor (too eggy or too much uncooked flour).  Nothing was extraordinary, but I applaud the cause.",
            "languageCode": "en"
          },
          "time": "a month ago"
        },
        {
          "author": "Pamela Peckman",
          "rating": 5,
          "text": {
            "text": "Phenomenal! The food was incredible. Had the bacon, tomato and grilled cheese sandwich. Service was very accommodating because two minutes after we were sat we found out our next appointment moved up and they quickly changed our order to- go and had us on our way. And of course the cats were adorable.",
            "languageCode": "en"
          },
          "time": "3 months ago"
        },
        {
          "author": "Z",
          "rating": 5,
          "text": {
            "text": "Excellent service: attentive, thorough, and accommodating with recommendations and options. By far the best chip beef I’ve been served, the custom omelette was perfect and the sourdough toast it came with was fresh, flavorful and perfectly toasted. If you like scrapple, they cook it to absolute perfection. Pan seared, not deep fried, as it should be. 😮‍💨🤌\n10/10 would recommend and come back!!",
            "languageCode": "en"
          },
          "time": "3 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ0a9pXvwifAPX5FGP0GW4a7ZZyRroDg1FHLsxEKMRe9WDHEwmjes6_3GVjBdHG9Kgz1xdvtGTae28CCRMQN-t4gUp5RLx-g_3Q8G9qsGGGBWuA2hkz4sKPVfPOZZf0Jnuri-gUvFIa4GEvrVEagLfjpKkUDQBZSxC_RP-9gcSJ1FD9WrWj08Blmniu-h55DiR0eZHY885abBofbu6_iR5cGe5ainFFMU3JVeGySZZXy0VUnGJzqBpiVtDlaYpOv1_cWRC57NlUne_SEnyJL9SeiLnzFRBx6HRuvnHxBTjF-GQ&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Philadelphia": [
    {
      "name": "Le Cat Cafe",
      "address": "2713 W Girard Ave, Philadelphia, PA 19130, USA",
      "rating": 4.7,
      "user_ratings_total": 415,
      "website": "http://lecatcafe.org/",
      "price_level": "PRICE_LEVEL_INEXPENSIVE",
      "google_maps_url": "https://maps.google.com/?cid=13876282688723176912",
      "lat": 39.9744732,
      "lng": -75.1808914,
      "accessibility_options": {
        "wheelchairAccessibleEntrance": true
      },
      "reviews": [
        {
          "author": "Alejandro Blanco",
          "rating": 5,
          "text": {
            "text": "Well, this was a first for me. My daughter loves cats, so we went to a cat cafe. A very interesting place, they bring in stray cats off the streets and give them a place to stay, hoping to be adopted. They are cleaned, tested, vaccinated, and spayed/neutered.\nThe cafe looks like a playground for cats, with toys and platforms all over for the cats to entertain themselves.\nThe cafe also offers free coffee/tea, hot cocoa and other drinks to enjoy while you keep the cats company.\nAll the cats are up for adoption or to foster. In 2024 alone, they had gotten over 350 cats adopted! It was a fun time, especially watching my daughter’s heart melt while the 10+ cats in this place scurried around and played!",
            "languageCode": "en"
          },
          "time": "2 months ago"
        },
        {
          "author": "Lex Jay",
          "rating": 5,
          "text": {
            "text": "had a nice time at this cafe. so many cats with different personalities, it was nice to get to know some of them a bit. the workers knew a lot about each cat and were really helpful in their explanation. they were also really friendly which is always a plus. i just came for the vibes, though i would potentially be open to adopting a cat in the right timing. i do wish they had non-caffeinated tea which was the only down side for me. will likely return. 💗",
            "languageCode": "en"
          },
          "time": "2 months ago"
        },
        {
          "author": "Jackie",
          "rating": 5,
          "text": {
            "text": "This place goes above and beyond to help find loving homes for cats. I adopted a cat from there in 2019 and renamed him Alamo. All the cats in the cafe are available for adoption and even if someone is not looking to adopt, they can come and play with cats while sipping coffee. Bree, one of the ladies that works there was so friendly and told us about all the cats; their names and personalities. She also listened while I told her about my cat. This place is amazing!",
            "languageCode": "en"
          },
          "time": "2 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ0RkHlr1MBQL-qx29-bnTRoGg6rsehamj1yQ8Nke3Rd6Dh2XQbR8co_9yirQq4fkVg9Epl6k_DVups_CaTPVWjSKFSz8dXzGjLo3FUacKut1V8RHLFX8jMn8oQhaM9wHKpkwpBV51uZGub0sfTWrBxY0KnSUfLG1TNPNaOcE77SclfsVSRwFWf6BSfnsn9_RBT7H2myXNrbXUnr-McIzjAZWWOPDOmvSdHYlq-uu1hqXEY6WLIl0J5krBJbxu2nQ-feS0XQLNU1GqnSRz1lEB9D-WH9oRroj6An5mk0rTDrciZ1NfT5tYti5AYVMQo4HdRT6UWQpcs-jfrBLLND2fW9TOYXRBJ4ToKsdEFf6i6xL6Yephj0yNWs9ByCjf6G4za5-ilQ_9SaS-BizRSzx43kSATG-BA&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    },
    {
      "name": "Whiskers Cat Cafe Philly",
      "address": "1440 Snyder Ave, Philadelphia, PA 19145, USA",
      "rating": 4.9,
      "user_ratings_total": 196,
      "website": "https://whiskerscatcafe.org/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=10087118929887177828",
      "lat": 39.9243861,
      "lng": -75.1713078,
      "accessibility_options": "N/A",
      "reviews": [
        {
          "author": "Leanne M",
          "rating": 4,
          "text": {
            "text": "Had the best time with the cats here at Whiskers! The owners/workers are gems of people who are just so kind and want you to be comfortable and meet all the babies. They are dedicated to the cats in their care and are quite laid back.\nThe kitten room was fun but was hard to enjoy due to the smell. The room does not get circulation so there is a very overwhelming litter smell. That can probably be aided with air purifiers and litter deodorizer. Overall I enjoyed my visit, will likely be back, and will be recommending to others!",
            "languageCode": "en"
          },
          "time": "a month ago"
        },
        {
          "author": "Puja Das",
          "rating": 5,
          "text": {
            "text": "The owner is incredibly sweet, with stories about each cat that shows she is invested in the future of them all. Sweeter than her are the cats themselves! They are very friendly to humans. If you're ever looking to adopt a cat, I would highly recommend this place ",
            "languageCode": "en"
          },
          "time": "in the last week"
        },
        {
          "author": "Tesana Clayton-Sargent",
          "rating": 5,
          "text": {
            "text": "Tim and Lina are so sweet!! They introduced us to each cat and kitten and offered comfort & beverages. They made the cafe feel like a familiar home. All the cats were so sweet and adorable. Definitely a place to visit to de-stress if you love cats.",
            "languageCode": "en"
          },
          "time": "in the last week"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ0-uLpipSiRurxqYNyY4CHAaS7xXbTmOfl3R0fmI8jG-yMBRfFHaAoEg7Wglc-pclMLrKvVedy0N5YwTzz-Wyr2dQPYzYab-wHwBs7jNOmwlQVZBVprabgHw8yhfYvUsbRkot34HpZoUzJZnY-w754GdZTC14PTC9wHzRcrQevKg9NlzUYKJ2C6hf36gB0CGwdc5wUJeYGF0IF_pbBi2NM0T3cG3ubfqK9S-soZeV2ii6OKqnRYSyJl_tn6LDk59358Fyk-cHJJHKuimhbVNH7z5MMNahv0gRsOOdWTEyhPog&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Salisbury": [
    {
      "name": "Kitten Kafe",
      "address": "302 A, 302 Kay Ave, Salisbury, MD 21801, USA",
      "rating": 4.8,
      "user_ratings_total": 25,
      "website": "https://www.facebook.com/profile.php?id=100092586304336",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=1062206043658002386",
      "lat": 38.3365432,
      "lng": -75.6095235,
      "accessibility_options": {
        "wheelchairAccessibleParking": true,
        "wheelchairAccessibleEntrance": true
      },
      "reviews": [
        {
          "author": "A M",
          "rating": 5,
          "text": {
            "text": "We visited for the first time and LOVED Kitten Kafe! The volunteers are all so knowledgeable and welcoming, the kittens are darling and the location is purrrfect!\n\nMy daughter fell in love with a specific kitty (pictured) and we submitted an application for adoption at first visit! 🐈🥰😍\n\nUpdate: They have soooo many precious kitties with big personalities!",
            "languageCode": "en"
          },
          "time": "8 months ago"
        },
        {
          "author": "Laurel Kelly",
          "rating": 5,
          "text": {
            "text": "Get your kitten fix here! So many cute babies! We stayed for two hours just enjoying the little ones, having snacks, and relaxing. Thank you for caring for all of these kitties 😍\n\nSo tempting to take everyone home with us. The staff and volunteers do so much to care for every single kitten and mama, we adopted our youngest cat from one of the fosters last year and just love her to bits. Snack prices are reasonable and they have some cute items for sale, too. I really liked the diy water bottles with cat stickers, too. Clever and fun activity to take home if you can’t take home a kitten ❤️",
            "languageCode": "en"
          },
          "time": "a year ago"
        },
        {
          "author": "Judy Manuel",
          "rating": 5,
          "text": {
            "text": "I had a most marvelous experience at Kitten Kafe! Am adopting a sweet boy from there - staff are amazing and are very invested in cat welfare.",
            "languageCode": "en"
          },
          "time": "6 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ0nbrnX-toIOToq-B2Zr3VHGiFVt8F3e_8zGl17oVWwouaz6WQop91IAk63XvSoVc6b158Ob7YL6zJZH0Mbn42a8IZ6ygxmXoeFCU9xHcv5ZLyUOq36P0-E8UHvbytHjkogwgGf0Y2Zo3vSouRgrMNK6n87_QyfZO8j66k7b9t52JMIklyCZ4fd_QvCSbg51z2cXEvFASu2duiJIkon6TM1k1jrdUGKtNQCy2bgtcMqk43YPhcdIUc0VQZUdPR7NcOvhigpU7W_UcCHsbs5BDeJurf_LGqsbNUaywDPzasb0WwgZ40ZmVtE1QBen0rnEou_H1XEJQB3hCPHEyFC6E9QiK67aQ2hCc0GOiSEsGLE3dcoFTdhhiyQiJTT3V1l-bK6lSXig4QxXvrGbX3dccuN2euj5oPY&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Montchanin": [
    {
      "name": "Krazy Kat's",
      "address": "528 Montchanin Rd, Montchanin, DE 19710, USA",
      "rating": 4.4,
      "user_ratings_total": 370,
      "website": "https://krazykatsde.com/",
      "price_level": "PRICE_LEVEL_EXPENSIVE",
      "google_maps_url": "https://maps.google.com/?cid=404685142801187122",
      "lat": 39.789520499999995,
      "lng": -75.589105,
      "accessibility_options": {
        "wheelchairAccessibleParking": true,
        "wheelchairAccessibleEntrance": true,
        "wheelchairAccessibleRestroom": true,
        "wheelchairAccessibleSeating": true
      },
      "reviews": [
        {
          "author": "Marissa S",
          "rating": 5,
          "text": {
            "text": "Loved this farm to table restaurant! The restaurant has unique and corky decor that creates a cozy environment. The food was very tasty and fresh. I'm excited to come again and stay at the lodge next time- thank you Krazy Kat's!",
            "languageCode": "en"
          },
          "time": "2 months ago"
        },
        {
          "author": "Tinaji Yogini",
          "rating": 5,
          "text": {
            "text": "This vegetarian had her first “steak” in over 30 years! It’s off menu and cost who-knows what, but very tasty, with a meaty chew. Maybe more like Jack-fruit pulled pork. But a treat, and such a big serving I had leftovers the next day. Super fun staff, and silly posh atmosphere. Pricey but worth it.",
            "languageCode": "en"
          },
          "time": "4 months ago"
        },
        {
          "author": "Catherine P.",
          "rating": 4,
          "text": {
            "text": "This restaurant is adorable inside and the food was terrific, however the service was terrible. Our server never introduced herself or even spoke to us. We couldn't find her half the time. It took us an hour before we started eating, and she never returned to the table to see if we needed anything else. A different server brought our food out to the table from the kitchen. And there weren't that many other people in the restaurant, so we were pretty disappointed with the service. And since there were 10 of us, they charged 20% service charge, and also a blank line for additional tip, which we did not give. They even tried to cover up the 20% tip/service charge by signing their name real big across that line on the bill. I guess they thought we'd just look at the bottom line and pay that and then add another 20% tip!",
            "languageCode": "en"
          },
          "time": "a month ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ3WtF4yoH4FxSnh6u8kaGpC6PUpDQ_QgfLJX9uOZnBfMF1c2Ipb-P_tTyPtQlRCKQHXIu94WeyeEmWbd1W2qfEiOnqqTU9yxZ4gvfgZ-V6TymVwXC_pTTbCeEX2l7u3MU0588zUgKLwcaa_KI3jQxhS_XrNBs-176NK1-1HS6Tp9_DRf9i0mOTefzP7E0AZO4BR9sx4qnM3YIWl4-olYYRRyhypuAR30X0-fCDXqZrjP005OOtI4jGkFlg7KKmEaN1PPo14BOEZqL4It6xGK6k-SNBlGALgcSKR7iwZoOb86yn4Ycjk79ieLzLlka4D7ZQZYYQ4BWmqER7PYJ922zp6d24fjRY-coBmaiFVTPONQyRFWzyTRwH9N75jaOK12Dwp24WYPL7RRfly6nYL9KXlggLcDZai4st3&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Washington": [
    {
      "name": "Crumbs & Whiskers | Kitten & Cat Cafe.",
      "address": "3109 M St NW, Washington, DC 20007, USA",
      "rating": 4.7,
      "user_ratings_total": 934,
      "website": "http://www.crumbsandwhiskers.com/",
      "price_level": "PRICE_LEVEL_MODERATE",
      "google_maps_url": "https://maps.google.com/?cid=4645012754072052490",
      "lat": 38.9053136,
      "lng": -77.0614946,
      "accessibility_options": {
        "wheelchairAccessibleParking": false,
        "wheelchairAccessibleEntrance": false
      },
      "reviews": [
        {
          "author": "Amanda Rose",
          "rating": 5,
          "text": {
            "text": "Really fantastic place that lets you hang out with adoptable cats in an awesome atmosphere! It’s especially nice for people like me who cannot adopt another animal myself but loves animal experiences and supporting rescue. The facility was clean, decorated beautifully, staff were really friendly and shared background stories on the cats and the kitty cats are all clearly well cared for. Visited Washington DC from Milwaukee, WI and I’m so glad we added this to our travel itinerary. The free Polaroid snapshot is such a nice touch and so unique (I’ve been to 10 cat cafes and this is the only one I’ve seen do this). I wish caffeine free tea options were available and would have preferred an hour long session for the price we paid but it’s for a fantastic cause so - 5/5 stars!",
            "languageCode": "en"
          },
          "time": "5 months ago"
        },
        {
          "author": "Jillian Roth",
          "rating": 5,
          "text": {
            "text": "The sweetest cats I've ever encountered at any cat cafe. They were all happy and chillin. Some would approach you and others were so relaxed and happy they didn't mind at all when you approached them. A sweet cat in particular climbed right into my lap ❤️😁 we got a nice polaroid taken of me and my friend and now have that as a keepsake. From what I overheard, it sounds like all of the cats get adopted pretty quick. It feels good to support a place like this that does a lot of good things for cats and also is quite fun for me too!",
            "languageCode": "en"
          },
          "time": "2 months ago"
        },
        {
          "author": "Asha Singh",
          "rating": 5,
          "text": {
            "text": "Went for some kitty cuddle time and was not disappointed. The staff was friendly and kept a sharp eye on the cats. The cats were playful and energetic. We didn't get any food or drinks but they did have a menu. No shoes in the car hangout space so be sure to wear socks when you go. Also be patient, the cats operate on their own schedule.",
            "languageCode": "en"
          },
          "time": "4 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ1vvNofZalDVa0QOiaRnJ4A3q7jcLwTDVm8x5bINUJYkBd2VKr00NqCYg0pOy0U2XqLiW3C0e9i7tCJJiB_vVlVl2hRoB511H46_1EuyU0Ai45vTexukU4vM3WQDd2j2j8B5oGWv2pmvK8zET2x6N68f1UdG8m-Dh5Ywgn0vpIluy4yWEg02AEmxA3iQnipYvqBf5zjqD7yCjfN_0nC3_ZKNcnJT-Gdqz3gGgmsW32_PNBepRV3gyeO2ODqOexjqb5N3Ab1HihhCOdOM1t_JSQwEY2tNl8u3w-ypCKeh8FnIJo1CgtfZGjIHCQP2lfZZMi8aP_udgTxKysZICbGWYaoR3nGEyoyrIHXKN_DgcEuACjwl6AWqCcI9oYraTjXOufOvxgj2-nJgZzaVeF1blXJ3CF_J7W_&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Spring City": [
    {
      "name": "Craig’s Cat Cafe",
      "address": "11 Riverside Dr, Spring City, PA 19475, USA",
      "rating": 4.6,
      "user_ratings_total": 34,
      "website": "https://craigscatcafe.net/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=17746641619555313029",
      "lat": 40.180758999999995,
      "lng": -75.5463491,
      "accessibility_options": {
        "wheelchairAccessibleSeating": true
      },
      "reviews": [
        {
          "author": "Laurie Kay Seydel",
          "rating": 5,
          "text": {
            "text": "Absolutely the most precious little cafe with such a great cause! They sell coffee, treats & little trinkets where % of proceeds go to rescuing cats lives. Super friendly staff (small business ran by a mother and her two daughters); Cafe and cat area were both very clean, all kittens are up for adoption which is ran through a legit rescue that they partnered up with. Entry fee is $5 (with age restrictions for children & ONLY adults can pick the kittens up - children are not allowed…which I greatly RESPECT them for having these rules in place for the kittens safety). Overall, it was such a cute/pleasant experience and I can’t wait to bring my cat lover family & friends. Kudos ",
            "languageCode": "en"
          },
          "time": "7 months ago"
        },
        {
          "author": "Maria B.",
          "rating": 5,
          "text": {
            "text": "I can't get enough of this place! It’s my go-to whenever I need a mood boost or just want to relax. The cats are so friendly and absolutely adorable, making it impossible not to smile! :)",
            "languageCode": "en"
          },
          "time": "2 weeks ago"
        },
        {
          "author": "Allyson Lorenti",
          "rating": 4,
          "text": {
            "text": "Stopped by on a Sunday afternoon.  We are not newbies to this concept as we are regulars at Cats in Bloom in Bloomsburg PA.\n\nThe good:\nCats are clearly well cared for.\nThe room was the appropriate size for the number of cats.\nCats had access to clean water and food.\nCats had plenty of toys and some safe spaces if they didn’t want to socialize.\n\nThe bad:\nI 1000% disagree with the age policy (kids of all ages are allowed).  There were 3 kids there when we arrived (all clearly no more than age 7-8).  Two of them were relentlessly following cats around that clearly didn’t want to socialize with them.  One cat “warned” one of the kids multiple times but she didn’t stop.  Literally all of the cats but 1-2 were in a hiding spot.  Then a mom with FOUR kids walked in (age range was probably 5-10). That’s when we left.  I just couldn’t watch these kids stressing the cats out any longer.  Also - this was not a large room and there were now 8 adults and 7 kids in there.\n\nMy opinion may not be popular but I dont believe the owner’s intent is for this to be a petting zoo when it’s too cold for your kids to go outside.  And I realize an age policy may reduce the number of visitors - I’d happily spend more on admission to see these cats not have to deal with the stress of young children.\n\nI also think there should be a reservation system or a time limit or some way to cut down on the number of people in that room at one time.  At least at high traffic times.\n\nI really love this concept but there needs to be an age policy and you need more space.  Personally I would get rid of the cafe side and make the whole thing cat visitation.",
            "languageCode": "en"
          },
          "time": "a month ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ3axx-1Q_Ex17_xVEyL2bRsmCe9gWzZoImI-UCNrC6yGh9jn1Oe7cUJihxFz-dZZ5jejmvgeH9kAV1VKAzLGgQl7m2Xv9vUhioKVaMkzgckB4fKn7OIZF4PvpORbE_ML3YQiMs9FpLF2B8BBk-KA-nX0h1sIpZZMZfz5UQKnZjtGpKi1UbDL_fABkJH2pg81-ElhHlEtBfyRO1fcANeXXdW9L25VupMDnJap9dWWTdQTMBeoKNsiugGM6YPz0yKajnBGNfGxlLma0wgPsNJHZ60l3ytnpc9687q7JyGb8PvwbN8mgrqCDuKBYTauQzWepyXFsYDjyIryKT3tFEaMTrRo14ip6mOdPUPPkDaqkAFSUc3apqgy-pG5JFL2Qot2N8DhwTIt9bqLwFNkPIQBCDUtWixlWn4rg&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "New Haven": [
    {
      "name": "Mew Haven Cat Cafe",
      "address": "904 Whalley Ave, New Haven, CT 06515, USA",
      "rating": 4.8,
      "user_ratings_total": 1436,
      "website": "https://mewhavencatcafe.com/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=8099127131922963035",
      "lat": 41.3271622,
      "lng": -72.9604342,
      "accessibility_options": {
        "wheelchairAccessibleEntrance": true,
        "wheelchairAccessibleRestroom": true
      },
      "reviews": [
        {
          "author": "Maria E. Tapia-Paez",
          "rating": 5,
          "text": {
            "text": "We visited Mew Heaven Cat Cafe on Sunday, and it was such a delightful experience! Booking our tickets ahead of time online was super easy and convenient. Once we arrived, we enjoyed some delicious coffee and tea while spending time with the adorable cats. The space is cozy, and the staff, especially Angela, the owner, was super friendly and welcoming. She really made our visit even more special. It’s the perfect place to relax and enjoy some time with furry friends. We had a great time and will definitely be back! Highly recommend for any cat lover!",
            "languageCode": "en"
          },
          "time": "5 months ago"
        },
        {
          "author": "Jack VK",
          "rating": 5,
          "text": {
            "text": "This was such an amazing experience! The staff was so friendly. The gift shop prices were amazing! They also have a sheet on how each cat acts. A cat climbed up on my lap for around 30-40 minutes. It is such a beautiful and simple experience. I recommend that everyone goes here at least once. My only complaints are  that it's is only around 1 hour! Lol! I would spend all day here if I was able to! Also, It was around 30 minutes away! I wish there were so many more of these across the world!!!!! Overall, this was one of the best experiences of my life! If it is so relaxing and so enjoyable. I really hope to go back again soon!!!!!",
            "languageCode": "en"
          },
          "time": "a month ago"
        },
        {
          "author": "Diamanto Antonellis",
          "rating": 5,
          "text": {
            "text": "This place is amazing! My granddaughter loved loved to pet the cats and she had a great time. I had a good relaxing time as well! I had cats as long as I can remember my self, so seeing all these babies today it was an amazing experience!! We will definitely visit you again.",
            "languageCode": "en"
          },
          "time": "5 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ1x3nOFtlolSfV-4HKMbd-FmA9yqYv2p-XAYE40R9XSWcWyVwZUxLd25WNdUHGFCwitSS0Iyz6yeTQ7z_MlKCUSr-_I51z-LJB47l0v_jVoSNSMe-o27AnlZ11vT6aOzO_nhV_EzrZr-oGK5QejWiB89zrXDk6Ws0BRbRzt-WFmDucpFcgkuO-emBq3nnbbCTXuGsMIK6UGpZdVAO0hGkyZn8tOl3jbWj1KG_4XjAHzTzou8CRx4LfNWe-BULxrOFi0PFOJ7_0EDqvMAZpGRu2HgJODgSWA5_KI5HGXTqlSQ_Z-yw5ScKzJBc8Ye8tkaZWlIkVUY5mB1StKsor1jwOsr_l8tNZ0-t8tEhd2UrvB-Jl-y7hK4MtlA7uIAonQqQYQ1_HpEMGhMMhuvzJ-TiktDFd03Hvd6g&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Alexandria": [
    {
      "name": "Mount Purrnon Cat Café + Wine Bar",
      "address": "109 S Alfred St, Alexandria, VA 22314, USA",
      "rating": 4.8,
      "user_ratings_total": 415,
      "website": "https://www.mtpurrnoncatcafe.com/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=16103787686130584231",
      "lat": 38.8048828,
      "lng": -77.0494978,
      "accessibility_options": {
        "wheelchairAccessibleEntrance": true,
        "wheelchairAccessibleRestroom": true,
        "wheelchairAccessibleSeating": true
      },
      "reviews": [
        {
          "author": "Kathy G.",
          "rating": 5,
          "text": {
            "text": "The cafe is such a great addition to the cat space, and it’s clear that the cats are well loved and taken care of. Some cats are seniors and just living out their last years in a bright, clean, lovely space, and others are much younger who are eager to make friends! The staff genuinely care about the cats and their care. Please stop by, support them and adopt!",
            "languageCode": "en"
          },
          "time": "a week ago"
        },
        {
          "author": "Carrie Devorah",
          "rating": 5,
          "text": {
            "text": "MOUNT PURRNON CAT CAFE & WINE BAR has become a must-do for out of town kiddos visiting Northern Virginia, if you love cats and you love kiddies.\n\nMount Purrnon is located on Alfred Street just off King Street, the main 'drag' in Old Town Alexandria so everywhere you turn you are walking in historic footsteps. Parking is on the street. Payment is fed in to free standing rectangles. The receipt is placed on your car dashboard.\n\nMount Purrnon is a healthy walk towards the water with your back to the Metro. If you are lucky, you can catch Old Town's free trolley, a fun thing kids of all ages love to do. The trolley will land you near enough to the cafe allowing you to combine two kid fun events in one outing. ,\n\nThe Mount Purrnon Cafe is kitty corner to a vintage shop, around the cornerdown the street from Sephora and up the street from the amazing Torpedo Factory.\n\nEntering Mount Purrnon Cat Cafe + Wine Bar, you enter the most delightful gift shop filled with cat 'stuff' of all types, high end, crafty and lower priced fun stuff, all benefiting the charity housed in this historic house once upon a time someone, maybe, infamous in history lived there, after all, ghosts of America's fathers still live there, technically.\n\nFriendly volunteers sit waiting to take payment for adults, kids, lunch if you choose and the length of time your visit to last- 1/2 hour, an hour. I once met a young woman who pretty much spent all day there. She said she found inner peace.\n\nMount Purrnon profiles its current residents on the wall in this room so you sorta have an idea which kitties you will be greeted by upstairs AND maybe even want to take home with you if you are in the market for a furrever friend.\n\nThe stairs are a bit steep heading up to the cattery. There are steps outside, too.\n\nBefore you head up, there is a downstairs eating place with a limited menu that includes out of this world cheese melt sandwich a finicky-as-a-cat four year old I know literally inhales this sandwich. There is a cat themed bathroom on the first floor. It's sort of a nice thing to do- eat first, fill your tummy then head up the stairs.\n\nThe photos speak for themselves. I wanted to take them all but, got a better offer, two kiddos who love love love coming here to Mount Purrnon Cafe. Thank you, yet again.\n\noh yeah, photos are copyright (c) Carrie Devorah and may not be used unless given permission by me, not by google or the cafe",
            "languageCode": "en"
          },
          "time": "a week ago"
        },
        {
          "author": "Rebecca AJ",
          "rating": 5,
          "text": {
            "text": "We had a wonderful time at Mount Purrnon! The staff was so helpful in answering our questions and they were informative of the cats. This business is doing wonderful things to support cats in the area. Will definitely be back!",
            "languageCode": "en"
          },
          "time": "in the last week"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ3Moj42y9_2qJ7VUhj1IOz3ZVyA1FttssLLFHpbwzlJn3uOx9mxqSCIrq4vz-5CHswwCZ_5wahEAz8t_TTG4IaY24oYZPsz4JQq9_VFbhHcMuk_CKuzIFqWRuEyoLgdkKCh2LUPshAstiYYy-M-6gsRmdgaDxzaiYKFe63uf10ir0qD5HRK6KV0j-0lGpqghnwvuBhiyDYz2nB93mrnBpgiBjW3gl0E0lVKTm-QmYE-DN4cyxH9fMKSKZBh7lxOYKldx8eWerqjxZ44SRrNO2aRYjnB-VTn7M4LRWhPg9l6dQ&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Blandon": [
    {
      "name": "Kitt's Café & Gandalf's Garden",
      "address": "8520 Allentown Pike Ste 13 & 14, Blandon, PA 19510, USA",
      "rating": 4.9,
      "user_ratings_total": 36,
      "website": "https://kittscafe.com/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=18191361061881913470",
      "lat": 40.4506637,
      "lng": -75.8930524,
      "accessibility_options": {
        "wheelchairAccessibleParking": true
      },
      "reviews": [
        {
          "author": "Amy Good",
          "rating": 5,
          "text": {
            "text": "This cat cafe is a must-visit! The space is bright, clean and spacious, filled with charming cat-themed merchandise and interesting houseplants. The coffee shop is great, offering delicious baked goods and pastries – especially their cinnamon rolls, which are by far the best I've ever had! Order one and thank me later!\n\nThe real stars of the cafe are the adorable kittens and cats! There were so many sweet and playful adoptable cats roaming around, looking for cuddles and playtime. The staff were incredibly friendly and knowledgeable about each cat, and the adoption process is done on site.\n\nWhether you're a cat lover, a coffee enthusiast, or simply looking for a unique and heartwarming experience, this cafe is for you!\n\nI’ll be back with my laptop to work remotely in the cat room!  Totally worth the cost of entry to have the purrrfect remote working companions!",
            "languageCode": "en"
          },
          "time": "2 months ago"
        },
        {
          "author": "ang",
          "rating": 5,
          "text": {
            "text": "me and my friend went to this cat cafe, the closet one to reading. this is the best place ever.\n\nfor food i ordered chicken bacon ranch wrap, a HUGE cinnamon roll, and the tiramisu iced coffee.\nI'm NOT overexaggerating, that food was AMAZING. Everything was a 10/10. The wrap, chicken was cooked perfectly, bacon was good and crisp, ranch tasted so good, all of it combined was heaven. The cinnamon roll was HUGE, its a MOUTAIN roll, it's so different than store brought, the icing is so different from store brought but its the best cinnamon roll icing i ever tasted, let alone the BEST cinnamon roll I've tasted in my whole 17 years. It's the most softest, tastiest, mouth watering cinnamon roll you'll EVER come across. and then the tiramisu iced coffee, OH MY GOD. i never taste anything like that, its so unique and genius. i just love it. no words.\nmy friend only got the mini breakfast pizza bacon egg and cheddar. i tasted it, THE BREAD IS SUPER SOFT, YOU NEED TO TRY. TRY IT TRY IT TRY IT TRY ITT. ITS SO GOOD SOFT AND SMELLS GOOD.\n\nI HIGHLY RECCOMEND TRYING THAT WRAP AND CINNAMANROLL. also if they have that s'more brownie TRY IT, i sadly wasn't able to today but soon.\n\nnow for the cats.\n$8 per person for 30 minutes.\nand i THINK $12 for 60 minutes per person.\nthere's hand sanitizer and lint rollers already, there's a door to the cat room and then a gate. there's cat toys so you can play with them. i heard if you go early most of the cats are up (I'm not positive) I went around 3:30PM.\nthe big chunky black cat is ace, I LOOVE HIM. HE WOKE UP FORM HIS SLUMBER AND INSANTLY CAME TO ME. THE WHITE ONE was so cute, look at the pink paws. literally so adorable. theres a kitten too, SO MANY CATSS.\n\nthe atsmposphere was nice, I wasn't able to get pictures because I was least focus on that but its a nice quiet cafe, i feel like i can work on my school assignments there peacefully. they have music but its low, and the staff was friendly.\n\noverall i REALLY recommend this place.",
            "languageCode": "en"
          },
          "time": "3 weeks ago"
        },
        {
          "author": "Rachel Schmiedberg",
          "rating": 5,
          "text": {
            "text": "If you love Cats, Coffee, and Plants, this is a fun place to visit. Lots of cats to just hang out with and drink your coffee/latte/tea. They have a small selection of nice looking house plants... including cat grass.",
            "languageCode": "en"
          },
          "time": "3 weeks ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ3iQS_oEQ5z58SL7OqcNQOZllanUg4iAZnCASIWkANfMbmRBghZtPP5hHCRuw7b0yA5VOpZ3E55hkogqacyO8OyGtR-NAmkLmbV3518WpYKUncYe37y6c-DA9mGDrWKyMZpY_ZfiyBjTJ1QsnqA3jvpE_hKTfokSRk79hDTcDMezOnptci8jlVX3tB9hLQkL4wXKU0OG1MFo9LUOLdHoBN3Hg8gkAIfNgHLmPEa2sG_gxGXaN8gLCtUlgq9g353RoYlQqikiEdUtWRyTs_3RR0ttA0VxhEnrEtfjueIzyrHZA&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Waldorf": [
    {
      "name": "Feline Felons Cat Cafe",
      "address": "24 Industrial Park Dr #1, Waldorf, MD 20603, USA",
      "rating": 4.8,
      "user_ratings_total": 41,
      "website": "https://www.felinefelonscatcafe.com/",
      "price_level": "N/A",
      "google_maps_url": "https://maps.google.com/?cid=13386713300282808096",
      "lat": 38.616405799999995,
      "lng": -76.9071888,
      "accessibility_options": {
        "wheelchairAccessibleParking": true,
        "wheelchairAccessibleEntrance": true,
        "wheelchairAccessibleRestroom": true,
        "wheelchairAccessibleSeating": true
      },
      "reviews": [
        {
          "author": "Amanda Gunther",
          "rating": 5,
          "text": {
            "text": "The Humans, Peggy & Matt, are excellent conversationalists who clearly care very, very much about the wonderful feline population here who are awaiting their furever home! They are incredibly knowledgeable about all the cats who are temporary residents. The cats are AMAZING. Their space is extraordinary, their adoption options are wonderful! And there are a bunch of really great cat-themed things you can buy in the \"meow-shop\"",
            "languageCode": "en"
          },
          "time": "in the last week"
        },
        {
          "author": "Hanah Ngo",
          "rating": 5,
          "text": {
            "text": "The best cat cafe place that cat lovers should check out,even best place for your kids !!! Great experience ! Great staffs ! We definitely come back soon . My kids enjoyed their time there with all lovely kittens, they want to come back to see cat lounge .And we love their cat gifts shop with affordable prices .They have kittens and cats for adoption (the fee to me is much better than any places I used to ).",
            "languageCode": "en"
          },
          "time": "4 months ago"
        },
        {
          "author": "Robert Hudler",
          "rating": 5,
          "text": {
            "text": "If you love cats this is a place you must see. The workers are great and very helpful. Tons of kitty's that ate very loving all sizes and ages. Very clean and well kept... and yes we brought one home. We will be going back to just visit all the kitty's.  But really if you love cats it's 100% worth checking out.",
            "languageCode": "en"
          },
          "time": "2 months ago"
        }
      ],
      "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ2XT9mb6C2BxRlFOFe5nSCUJdDUrE-qAqYEGGlP4NoZ4SToXNvD3vElI9vRfKZVcSMCe2DXH5hRdohUheg1WrlinQHFIjMFPQQiOVs4mFS_zjnrLjQMWp_RlOOPIjB1_cp1Ml_LYIyGfLNojb-Pc8ItSMwGmvpOOyMwsJYavZBPI3JPvNmS3penhLrwQODI_6QcrS01VD5zGXVKb5Fo5U6Q9hJc1NAev58D2oSdJGGki_L5FxkvjRblZeKWpmJsqjHzT1AAMRRzKhxNjGcH0xCQVs16jRFI3Wt27TPF5ryj8g&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
    }
  ],
  "Newark": {
    "city": "Newark",
    "city_ascii": "Newark",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.6776,
    "lng": -75.7576,
    "cafes": [
      {
        "name": "Drip Cafe",
        "address": "60 N College Ave, Newark, DE 19711, USA",
        "rating": 4.5,
        "user_ratings_total": 310,
        "website": "http://www.dripcafede.com/",
        "price_level": "PRICE_LEVEL_INEXPENSIVE",
        "google_maps_url": "https://maps.google.com/?cid=161267676904740791",
        "lat": 39.6852108,
        "lng": -75.7541945,
        "accessibility_options": {
          "wheelchairAccessibleParking": true,
          "wheelchairAccessibleEntrance": true,
          "wheelchairAccessibleRestroom": true,
          "wheelchairAccessibleSeating": true
        },
        "reviews": [
          {
            "author": "Essie Griffin",
            "rating": 2,
            "text": {
              "text": "I feel like this place has so much potential but I’m not sure I’ll be back. Two weeks in a row I ordered a breakfast sandwich. If you can’t make a decent bacon/sausage egg and cheese then that’s a problem! The amount of food to bread ratio is off. Either use smaller bread or give 2 eggs instead of 1 tiny egg and small piece of meat for a sandwich. The cheese was completely missing last week. This week they had to have only put a few sprinkles. The price is low and that’s great except I’d rather them charge more and give a great product. This is just a sad waste.",
              "languageCode": "en"
            },
            "time": "2 months ago"
          },
          {
            "author": "J Brown",
            "rating": 5,
            "text": {
              "text": "Surprised and delighted to announce that the Caramel Apple Pancakes were the best pancakes I've ever had! Fluffy and flavorful. Plus the bits of bacon perfectly complimented the caramel sauce. 10/10\n\nWe also got the Smoked Salmon Toast which was delicious!!",
              "languageCode": "en"
            },
            "time": "a month ago"
          },
          {
            "author": "Titi",
            "rating": 5,
            "text": {
              "text": "Very impressed with Drip. The food was delicious. Lots of indoor and outdoor seating and the staff was super friendly. I don't eat pork and I didn't know that there was bacon on my pancakes. They were so nice and understanding. Made me a new one immediately. Definitely going back to try other things on the menu!",
              "languageCode": "en"
            },
            "time": "2 years ago"
          }
        ],
        "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ1QIjmkAS2sYItZzHUChxnUScJA8rI0h12zRpYaKGHrXLkl1fY1ydZEEoPzqMv95YhKGZJFJSOHBoF_Atso-s_lzX936ZNFeVLSNaVOVqSqmd_q4oIqWXS-ZLPkdWs37xfDHCtSY1auLbU1f6Z-5h8EXeG0nkzUS_V8SZJ3y7HnacR9G8IYdaQijJpwDKVbSuH_nHmXR7IT5oQFcDUIOh5Q0KbVCm8SAzEw1OCtee1AWdyh71IEK4kqbgXcirQLJYwyrrCHT3MRoTOmcH2BY6zahejD3G7aRxqElQHM0tYUfg&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
      }
    ]
  },
  "Rehoboth Beach": {
    "city": "Rehoboth Beach",
    "city_ascii": "Rehoboth Beach",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.7172,
    "lng": -75.0845,
    "cafes": [
      {
        "name": "Salty Paws Doggy Ice Cream Bar And Bakery",
        "address": "43 Rehoboth Ave, Rehoboth Beach, DE 19971, USA",
        "rating": 4.6,
        "user_ratings_total": 73,
        "website": "N/A",
        "price_level": "N/A",
        "google_maps_url": "https://maps.google.com/?cid=6152800276861464049",
        "lat": 38.7169956,
        "lng": -75.07770040000001,
        "accessibility_options": {
          "wheelchairAccessibleParking": true
        },
        "reviews": [
          {
            "author": "Kristen R",
            "rating": 5,
            "text": {
              "text": "Opal Rae had a pleasant surprise on her way out of town. We stopped in to treat her to some doggy ice cream. She was eager to see what was in the store and sniff everything.\nThat experience was so fun as pet owners sharing our first puppy together as a couple.\nWe thoroughly enjoyed ordering opals ice cream for there and sitting her in her own dog bed seat to eat her ice cream.\nShe ate like she were at the dinner table with us and it was hilarious and cute all at the same time.\nShe is usually completely into greeting every dog she sees but no dog could come in between this girl and her table top ice cream.\nSo happy to have found such a fun place. We will definitely be back with Opal on future beach trips.",
              "languageCode": "en"
            },
            "time": "4 months ago"
          },
          {
            "author": "StrayKitty",
            "rating": 5,
            "text": {
              "text": "What a fun experience for you and your dog! This store offers a variety of dog treats and toys, as well as a little cat section for your feline friends. We visited yesterday and the woman who helped us was exceptional. Truly wonderful customer service.  Their ice cream selection is a dream come true for any doggy!",
              "languageCode": "en"
            },
            "time": "5 months ago"
          },
          {
            "author": "Mel Miller",
            "rating": 5,
            "text": {
              "text": "What a cute puppy place! The service was great, informative of the products and suggestions. We took our own little \"Salty Paws\" Ralphie for ice cream and he was in heaven! We'll be back soon.",
              "languageCode": "en"
            },
            "time": "8 months ago"
          }
        ],
        "photoUri": "https://maps.googleapis.com/maps/api/place/photo?maxwidth=800&photo_reference=AUy1YQ3LxwfTTYRcxeRWMn7CVddCILe1uFvcOZksw7WophXoVAtyHuSJ35Dl9aNuRCJraXxcpM8SoPvlD4aPsrFNurpZRH-KIfxqKGCD4PAfvnXU-D1CuZegPdRsPU_oHb0eR-_AB799lIOvADOCst4HSo4bdnjlKj-RHMUw0aPic3ujuhr8hkx_Z3ILAKMyL7I87Jwn-3BKQw4b8LSpTxbvtPIH4ssJExqihdK4sBQX1sQsEI6ARs0oi5QxiENwAj2_hbA8GE6DyVqMh0R4JJGWtyrv24KFx2HDR1OZSYeZcc1mhQ&key=AIzaSyA0hpGzherXfW2vtqgNh57s9WXSJEukTb8"
      }
    ]
  },
  "Dover": {
    "city": "Dover",
    "city_ascii": "Dover",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.161,
    "lng": -75.5202,
    "cafes": []
  },
  "Wilmington": {
    "city": "Wilmington",
    "city_ascii": "Wilmington",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7415,
    "lng": -75.5416,
    "cafes": []
  },
  "Middletown": {
    "city": "Middletown",
    "city_ascii": "Middletown",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.445,
    "lng": -75.7183,
    "cafes": []
  },
  "Bear": {
    "city": "Bear",
    "city_ascii": "Bear",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.6189,
    "lng": -75.6808,
    "cafes": []
  },
  "Glasgow": {
    "city": "Glasgow",
    "city_ascii": "Glasgow",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.6015,
    "lng": -75.7473,
    "cafes": []
  },
  "Brookside": {
    "city": "Brookside",
    "city_ascii": "Brookside",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.6665,
    "lng": -75.7152,
    "cafes": []
  },
  "Hockessin": {
    "city": "Hockessin",
    "city_ascii": "Hockessin",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7837,
    "lng": -75.6815,
    "cafes": []
  },
  "Smyrna": {
    "city": "Smyrna",
    "city_ascii": "Smyrna",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.2935,
    "lng": -75.6083,
    "cafes": []
  },
  "Milford": {
    "city": "Milford",
    "city_ascii": "Milford",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.9091,
    "lng": -75.4227,
    "cafes": []
  },
  "Pike Creek Valley": {
    "city": "Pike Creek Valley",
    "city_ascii": "Pike Creek Valley",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7294,
    "lng": -75.6989,
    "cafes": []
  },
  "Claymont": {
    "city": "Claymont",
    "city_ascii": "Claymont",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.8032,
    "lng": -75.4607,
    "cafes": []
  },
  "Seaford": {
    "city": "Seaford",
    "city_ascii": "Seaford",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.6538,
    "lng": -75.611,
    "cafes": []
  },
  "North Star": {
    "city": "North Star",
    "city_ascii": "North Star",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.755,
    "lng": -75.7331,
    "cafes": []
  },
  "Wilmington Manor": {
    "city": "Wilmington Manor",
    "city_ascii": "Wilmington Manor",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.6858,
    "lng": -75.5849,
    "cafes": []
  },
  "Georgetown": {
    "city": "Georgetown",
    "city_ascii": "Georgetown",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.6894,
    "lng": -75.3872,
    "cafes": []
  },
  "Pike Creek": {
    "city": "Pike Creek",
    "city_ascii": "Pike Creek",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7488,
    "lng": -75.695,
    "cafes": []
  },
  "Millsboro": {
    "city": "Millsboro",
    "city_ascii": "Millsboro",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5892,
    "lng": -75.3089,
    "cafes": []
  },
  "Edgemoor": {
    "city": "Edgemoor",
    "city_ascii": "Edgemoor",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7547,
    "lng": -75.5069,
    "cafes": []
  },
  "Elsmere": {
    "city": "Elsmere",
    "city_ascii": "Elsmere",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7384,
    "lng": -75.5946,
    "cafes": []
  },
  "New Castle": {
    "city": "New Castle",
    "city_ascii": "New Castle",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.6681,
    "lng": -75.5697,
    "cafes": []
  },
  "Rising Sun-Lebanon": {
    "city": "Rising Sun-Lebanon",
    "city_ascii": "Rising Sun-Lebanon",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1,
    "lng": -75.5047,
    "cafes": []
  },
  "Clayton": {
    "city": "Clayton",
    "city_ascii": "Clayton",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.2849,
    "lng": -75.6366,
    "cafes": []
  },
  "Laurel": {
    "city": "Laurel",
    "city_ascii": "Laurel",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5691,
    "lng": -75.5689,
    "cafes": []
  },
  "Camden": {
    "city": "Camden",
    "city_ascii": "Camden",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.099,
    "lng": -75.5571,
    "cafes": []
  },
  "Harrington": {
    "city": "Harrington",
    "city_ascii": "Harrington",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.9243,
    "lng": -75.5707,
    "cafes": []
  },
  "Highland Acres": {
    "city": "Highland Acres",
    "city_ascii": "Highland Acres",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1163,
    "lng": -75.5216,
    "cafes": []
  },
  "Milton": {
    "city": "Milton",
    "city_ascii": "Milton",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.775,
    "lng": -75.3102,
    "cafes": []
  },
  "Lewes": {
    "city": "Lewes",
    "city_ascii": "Lewes",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.7776,
    "lng": -75.145,
    "cafes": []
  },
  "Greenville": {
    "city": "Greenville",
    "city_ascii": "Greenville",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.778,
    "lng": -75.6046,
    "cafes": []
  },
  "Dover Base Housing": {
    "city": "Dover Base Housing",
    "city_ascii": "Dover Base Housing",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1178,
    "lng": -75.4837,
    "cafes": []
  },
  "Selbyville": {
    "city": "Selbyville",
    "city_ascii": "Selbyville",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.4629,
    "lng": -75.2117,
    "cafes": []
  },
  "Townsend": {
    "city": "Townsend",
    "city_ascii": "Townsend",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.3968,
    "lng": -75.6943,
    "cafes": []
  },
  "Ocean View": {
    "city": "Ocean View",
    "city_ascii": "Ocean View",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5355,
    "lng": -75.0984,
    "cafes": []
  },
  "Bridgeville": {
    "city": "Bridgeville",
    "city_ascii": "Bridgeville",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.7251,
    "lng": -75.6029,
    "cafes": []
  },
  "Kent Acres": {
    "city": "Kent Acres",
    "city_ascii": "Kent Acres",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1324,
    "lng": -75.516,
    "cafes": []
  },
  "Riverview": {
    "city": "Riverview",
    "city_ascii": "Riverview",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0293,
    "lng": -75.5202,
    "cafes": []
  },
  "Delmar": {
    "city": "Delmar",
    "city_ascii": "Delmar",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.4651,
    "lng": -75.5553,
    "cafes": []
  },
  "Long Neck": {
    "city": "Long Neck",
    "city_ascii": "Long Neck",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.6205,
    "lng": -75.1529,
    "cafes": []
  },
  "Millville": {
    "city": "Millville",
    "city_ascii": "Millville",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5356,
    "lng": -75.1284,
    "cafes": []
  },
  "Delaware City": {
    "city": "Delaware City",
    "city_ascii": "Delaware City",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.574,
    "lng": -75.5938,
    "cafes": []
  },
  "Cheswold": {
    "city": "Cheswold",
    "city_ascii": "Cheswold",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.2189,
    "lng": -75.5882,
    "cafes": []
  },
  "Greenwood": {
    "city": "Greenwood",
    "city_ascii": "Greenwood",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.8072,
    "lng": -75.59,
    "cafes": []
  },
  "Wyoming": {
    "city": "Wyoming",
    "city_ascii": "Wyoming",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1147,
    "lng": -75.563,
    "cafes": []
  },
  "Woodside East": {
    "city": "Woodside East",
    "city_ascii": "Woodside East",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0676,
    "lng": -75.5376,
    "cafes": []
  },
  "Lincoln": {
    "city": "Lincoln",
    "city_ascii": "Lincoln",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.868,
    "lng": -75.4229,
    "cafes": []
  },
  "St. Georges": {
    "city": "St. Georges",
    "city_ascii": "St. Georges",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.5606,
    "lng": -75.6514,
    "cafes": []
  },
  "Bellefonte": {
    "city": "Bellefonte",
    "city_ascii": "Bellefonte",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7668,
    "lng": -75.4982,
    "cafes": []
  },
  "Dagsboro": {
    "city": "Dagsboro",
    "city_ascii": "Dagsboro",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5462,
    "lng": -75.2458,
    "cafes": []
  },
  "Rodney Village": {
    "city": "Rodney Village",
    "city_ascii": "Rodney Village",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1283,
    "lng": -75.5396,
    "cafes": []
  },
  "Newport": {
    "city": "Newport",
    "city_ascii": "Newport",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.7135,
    "lng": -75.6046,
    "cafes": []
  },
  "Felton": {
    "city": "Felton",
    "city_ascii": "Felton",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0127,
    "lng": -75.5765,
    "cafes": []
  },
  "Blades": {
    "city": "Blades",
    "city_ascii": "Blades",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.6353,
    "lng": -75.6024,
    "cafes": []
  },
  "Frederica": {
    "city": "Frederica",
    "city_ascii": "Frederica",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0081,
    "lng": -75.4667,
    "cafes": []
  },
  "Bethany Beach": {
    "city": "Bethany Beach",
    "city_ascii": "Bethany Beach",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5391,
    "lng": -75.066,
    "cafes": []
  },
  "Frankford": {
    "city": "Frankford",
    "city_ascii": "Frankford",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5215,
    "lng": -75.2342,
    "cafes": []
  },
  "Ellendale": {
    "city": "Ellendale",
    "city_ascii": "Ellendale",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.8102,
    "lng": -75.425,
    "cafes": []
  },
  "Arden": {
    "city": "Arden",
    "city_ascii": "Arden",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.8114,
    "lng": -75.4886,
    "cafes": []
  },
  "South Bethany": {
    "city": "South Bethany",
    "city_ascii": "South Bethany",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.516,
    "lng": -75.0589,
    "cafes": []
  },
  "Port Penn": {
    "city": "Port Penn",
    "city_ascii": "Port Penn",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.5169,
    "lng": -75.5811,
    "cafes": []
  },
  "Houston": {
    "city": "Houston",
    "city_ascii": "Houston",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.9174,
    "lng": -75.5039,
    "cafes": []
  },
  "Bethel": {
    "city": "Bethel",
    "city_ascii": "Bethel",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.5711,
    "lng": -75.6195,
    "cafes": []
  },
  "Slaughter Beach": {
    "city": "Slaughter Beach",
    "city_ascii": "Slaughter Beach",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.915,
    "lng": -75.309,
    "cafes": []
  },
  "Odessa": {
    "city": "Odessa",
    "city_ascii": "Odessa",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.4565,
    "lng": -75.6605,
    "cafes": []
  },
  "Fenwick Island": {
    "city": "Fenwick Island",
    "city_ascii": "Fenwick Island",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.4604,
    "lng": -75.0542,
    "cafes": []
  },
  "Kenton": {
    "city": "Kenton",
    "city_ascii": "Kenton",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.2274,
    "lng": -75.6646,
    "cafes": []
  },
  "Dewey Beach": {
    "city": "Dewey Beach",
    "city_ascii": "Dewey Beach",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.6958,
    "lng": -75.0749,
    "cafes": []
  },
  "Woodside": {
    "city": "Woodside",
    "city_ascii": "Woodside",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0711,
    "lng": -75.5677,
    "cafes": []
  },
  "Bowers": {
    "city": "Bowers",
    "city_ascii": "Bowers",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0602,
    "lng": -75.402,
    "cafes": []
  },
  "Ardentown": {
    "city": "Ardentown",
    "city_ascii": "Ardentown",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.8083,
    "lng": -75.4809,
    "cafes": []
  },
  "Magnolia": {
    "city": "Magnolia",
    "city_ascii": "Magnolia",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0714,
    "lng": -75.476,
    "cafes": []
  },
  "Little Creek": {
    "city": "Little Creek",
    "city_ascii": "Little Creek",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1659,
    "lng": -75.4481,
    "cafes": []
  },
  "Farmington": {
    "city": "Farmington",
    "city_ascii": "Farmington",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.8699,
    "lng": -75.579,
    "cafes": []
  },
  "Henlopen Acres": {
    "city": "Henlopen Acres",
    "city_ascii": "Henlopen Acres",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 38.7257,
    "lng": -75.0849,
    "cafes": []
  },
  "Ardencroft": {
    "city": "Ardencroft",
    "city_ascii": "Ardencroft",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.8056,
    "lng": -75.4862,
    "cafes": []
  },
  "Leipsic": {
    "city": "Leipsic",
    "city_ascii": "Leipsic",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.243,
    "lng": -75.5155,
    "cafes": []
  },
  "Hartly": {
    "city": "Hartly",
    "city_ascii": "Hartly",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.1683,
    "lng": -75.7124,
    "cafes": []
  },
  "Viola": {
    "city": "Viola",
    "city_ascii": "Viola",
    "state_id": "DE",
    "state_name": "Delaware",
    "lat": 39.0429,
    "lng": -75.5715,
    "cafes": []
  }
}